


Network Working Group                                           J. Jeong
Internet-Draft                                   Sungkyunkwan University
Obsoletes: 6106 (if approved)                                    S. Park
Intended status: Standards Track                     Samsung Electronics
Expires: September 15, 2016                                   L. Beloeil
                                                      France Telecom R&D
                                                          S. Madanapalli
                                                       iRam Technologies
                                                          March 14, 2016


        IPv6 Router Advertisement Options for DNS Configuration
                  draft-ietf-6man-rdnss-rfc6106bis-10

Abstract

   This document specifies IPv6 Router Advertisement options to allow
   IPv6 routers to advertise a list of DNS recursive server addresses
   and a DNS Search List to IPv6 hosts.

   This document obsoletes RFC 6106 and allows a higher default value of
   the lifetime of the RA DNS options to avoid the frequent expiry of
   the options on links with a relatively high rate of packet loss.

Status of This Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on September 15, 2016.

Copyright Notice



Jeong, et al.          Expires September 15, 2016               [Page 1]

Internet-Draft             IPv6 RA DNS Options                March 2016


   Copyright (c) 2016 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
     1.1.  Applicability Statements . . . . . . . . . . . . . . . . .  3
     1.2.  Coexistence of RA Options and DHCP Options for DNS
           Configuration  . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Requirements Language  . . . . . . . . . . . . . . . . . . . .  4
   3.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   4.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  5
   5.  Neighbor Discovery Extension . . . . . . . . . . . . . . . . .  5
     5.1.  Recursive DNS Server Option  . . . . . . . . . . . . . . .  6
     5.2.  DNS Search List Option . . . . . . . . . . . . . . . . . .  7
     5.3.  Procedure of DNS Configuration . . . . . . . . . . . . . .  8
       5.3.1.  Procedure in IPv6 Host . . . . . . . . . . . . . . . .  8
       5.3.2.  Warnings for DNS Options Configuration . . . . . . . .  9
   6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  9
     6.1.  Security Threats . . . . . . . . . . . . . . . . . . . . .  9
     6.2.  Recommendations  . . . . . . . . . . . . . . . . . . . . . 10
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 10
   8.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 11
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 11
     9.1.  Normative References . . . . . . . . . . . . . . . . . . . 11
     9.2.  Informative References . . . . . . . . . . . . . . . . . . 12
   Appendix A.  Changes from RFC 6106 . . . . . . . . . . . . . . . . 13














Jeong, et al.          Expires September 15, 2016               [Page 2]

Internet-Draft             IPv6 RA DNS Options                March 2016


1.  Introduction

   The purpose of this document is to standardize an IPv6 Router
   Advertisement (RA) option for DNS Recursive Server Addresses used for
   the DNS name resolution in IPv6 hosts.  This RA option was originally
   specified in an earlier Experimental specification [RFC5006] and was
   later published as a Standards Track in [RFC6106].  This document
   obsoletes [RFC6106], allowing a higher default value of the lifetime
   of the RA DNS options to avoid the frequent expiry of the options on
   links with a relatively high rate of packet loss, and also making
   additional clarifications, see Appendix A for details.

   Neighbor Discovery (ND) for IP version 6 and IPv6 Stateless Address
   Autoconfiguration (SLAAC) provide ways to configure either fixed or
   mobile nodes with one or more IPv6 addresses, default routers, and
   some other parameters [RFC4861][RFC4862].  Most Internet names are
   identified by using a DNS name.  The two RA options defined in this
   document provide the DNS information needed for an IPv6 host to reach
   Internet names.

   It is infeasible to manually configure nomadic hosts each time they
   connect to a different network.  While a one-time static
   configuration is possible, it is generally not desirable on general-
   purpose hosts such as laptops.  For instance, locally defined name
   spaces would not be available to the host if it were to run its own
   recursive name server directly connected to the global DNS.

   The DNS information can also be provided through DHCPv6 [RFC3315]
   [RFC3736][RFC3646].  However, the access to DNS is a fundamental
   requirement for almost all hosts, so IPv6 stateless autoconfiguration
   cannot stand on its own as an alternative deployment model in any
   practical network without any support for DNS configuration.

   These issues are not pressing in dual-stack networks as long as a DNS
   server is available on the IPv4 side, but they become more critical
   with the deployment of IPv6-only networks.  As a result, this
   document defines a mechanism based on IPv6 RA options to allow IPv6
   hosts to perform the automatic DNS configuration.

1.1.  Applicability Statements

   RA-based DNS configuration is a useful alternative in networks where
   an IPv6 host's address is autoconfigured through IPv6 stateless
   address autoconfiguration and where there is either no DHCPv6
   infrastructure at all or some hosts do not have a DHCPv6 client.  The
   intention is to enable the full configuration of basic networking
   information for hosts without requiring DHCPv6.  However, for
   networks that need to distribute additional information, DHCPv6 is



Jeong, et al.          Expires September 15, 2016               [Page 3]

Internet-Draft             IPv6 RA DNS Options                March 2016


   likely to be employed.  In these networks, RA-based DNS configuration
   may not be needed.

   RA-based DNS configuration allows an IPv6 host to acquire the DNS
   configuration (i.e., DNS recursive server addresses and DNS Search
   List) for the link(s) to which the host is connected.  Furthermore,
   the host learns this DNS configuration from the same RA message that
   provides configuration information for the link.

   The advantages and disadvantages of the RA-based approach are
   discussed in [RFC4339] along with other approaches, such as the DHCP
   and well-known anycast address approaches.

1.2.  Coexistence of RA Options and DHCP Options for DNS Configuration

   Two protocols exist to configure the DNS information on a host, the
   Router Advertisement options specified in this document and the
   DHCPv6 options specified in [RFC3646].  They can be used together.
   The rules governing the decision to use stateful configuration
   mechanisms are specified in [RFC4861].  Hosts conforming to this
   specification MUST extract DNS information from Router Advertisement
   messages, unless static DNS configuration has been specified by the
   user.  If there is DNS information available from multiple Router
   Advertisements and/or from DHCP, the host MUST maintain an ordered
   list of this information as specified in Section 5.3.1.

2.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

3.  Terminology

   This document uses the terminology defined in [RFC4861] and
   [RFC4862].  In addition, four new terms are defined below:

   o  Recursive DNS Server (RDNSS): Server that provides a recursive DNS
      resolution service for translating domain names into IP addresses
      or resolving PTR records, as defined in [RFC1034] and [RFC1035].

   o  RDNSS Option: IPv6 RA option to deliver the RDNSS information to
      IPv6 hosts [RFC4861].

   o  DNS Search List (DNSSL): The list of DNS suffix domain names used
      by IPv6 hosts when they perform DNS query searches for short,
      unqualified domain names.




Jeong, et al.          Expires September 15, 2016               [Page 4]

Internet-Draft             IPv6 RA DNS Options                March 2016


   o  DNSSL Option: IPv6 RA option to deliver the DNSSL information to
      IPv6 hosts.

   o  DNS Repository: Two data structures for managing DNS Configuration
      Information in the IPv6 protocol stack in addition to Neighbor
      Cache and Destination Cache for Neighbor Discovery [RFC4861].  The
      first data structure is the DNS Server List for RDNSS addresses
      and the second is the DNS Search List for DNS search domain names.

   o  Resolver Repository: Configuration repository with RDNSS addresses
      and a DNS Search List that a DNS resolver on the host uses for DNS
      name resolution; for example, the Unix resolver file (i.e., /etc/
      resolv.conf) and Windows registry.

4.  Overview

   This document standardizes the ND option called the RDNSS option
   defined in [RFC6106] that contains the addresses of recursive DNS
   servers.  This document also standardizes the ND option called the
   DNSSL option defined in [RFC6106] that contains the Domain Search
   List.  This is to maintain parity with the DHCPv6 options and to
   ensure that there is necessary functionality to determine the search
   domains.

   The existing ND message (i.e., Router Advertisement) is used to carry
   this information.  An IPv6 host can configure the IPv6 addresses of
   one or more RDNSSes via RA messages.  Through the RDNSS and DNSSL
   options, along with the prefix information option based on the ND
   protocol ([RFC4861] and [RFC4862]), an IPv6 host can perform the
   network configuration of its IPv6 address and the DNS information
   simultaneously without needing DHCPv6 for the DNS configuration.  The
   RA options for RDNSS and DNSSL can be used on the network that
   supports the use of ND.

   This approach requires the manual configuration or other automatic
   mechanisms (e.g., DHCPv6 or vendor proprietary configuration
   mechanisms) to configure the DNS information in routers sending the
   advertisements.  The automatic configuration of RDNSS addresses and a
   DNS Search List in routers is out of scope for this document.

5.  Neighbor Discovery Extension

   The IPv6 DNS configuration mechanism in this document needs two ND
   options in Neighbor Discovery: (i) the Recursive DNS Server (RDNSS)
   option and (ii) the DNS Search List (DNSSL) option.






Jeong, et al.          Expires September 15, 2016               [Page 5]

Internet-Draft             IPv6 RA DNS Options                March 2016


5.1.  Recursive DNS Server Option

   The RDNSS option contains one or more IPv6 addresses of recursive DNS
   servers.  All of the addresses share the same Lifetime value.  If it
   is desirable to have different Lifetime values, multiple RDNSS
   options can be used.  Figure 1 shows the format of the RDNSS option.

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |     Length    |           Reserved            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                           Lifetime                            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     :            Addresses of IPv6 Recursive DNS Servers            :
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

           Figure 1: Recursive DNS Server (RDNSS) Option Format


   Fields:
     Type          8-bit identifier of the RDNSS option type as assigned
                   by the IANA: 25

     Length        8-bit unsigned integer.  The length of the option
                   (including the Type and Length fields) is in units of
                   8 octets.  The minimum value is 3 if one IPv6 address
                   is contained in the option.  Every additional RDNSS
                   address increases the length by 2.  The Length field
                   is used by the receiver to determine the number of
                   IPv6 addresses in the option.

     Lifetime      32-bit unsigned integer.  The maximum time in
                   seconds (relative to the time the packet is received)
                   over which these RDNSS addresses MAY be used for name
                   resolution.  The value of Lifetime SHOULD by default
                   be at least 3 * MaxRtrAdvInterval where
                   MaxRtrAdvInterval is the Maximum RA Interval defined
                   in [RFC4861].  A value of all one bits (0xffffffff)
                   represents infinity.  A value of zero means that the
                   RDNSS addresses MUST no longer be used.

     Addresses of IPv6 Recursive DNS Servers
                   One or more 128-bit IPv6 addresses of the recursive
                   DNS servers.  The number of addresses is determined
                   by the Length field.  That is, the number of



Jeong, et al.          Expires September 15, 2016               [Page 6]

Internet-Draft             IPv6 RA DNS Options                March 2016


                   addresses is equal to (Length - 1) / 2.

   Note:  The addresses for recursive DNS servers in the RDNSS option
      MAY be link-local addresses.  Such link-local addresses SHOULD be
      registered into the resolver repository along with the
      corresponding link zone indices of the links that receive the
      RDNSS option(s) for them.  The link-local addresses MAY be
      represented with their link zone indices in the textual format for
      scoped addresses as described in [RFC4007].  When a resolver sends
      a DNS query message to an RDNSS with a link-local address, it MUST
      use the corresponding link.

5.2.  DNS Search List Option

   The DNSSL option contains one or more domain names of DNS suffixes.
   All of the domain names share the same Lifetime value.  If it is
   desirable to have different Lifetime values, multiple DNSSL options
   can be used.  Figure 2 shows the format of the DNSSL option.

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |     Length    |           Reserved            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                           Lifetime                            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     :                Domain Names of DNS Search List                :
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

              Figure 2: DNS Search List (DNSSL) Option Format


   Fields:
     Type          8-bit identifier of the DNSSL option type as assigned
                   by the IANA: 31

     Length        8-bit unsigned integer.  The length of the option
                   (including the Type and Length fields) is in units of
                   8 octets.  The minimum value is 2 if at least one
                   domain name is contained in the option.  The Length
                   field is set to a multiple of 8 octets to accommodate
                   all the domain names in the field of Domain Names of
                   DNS Search List.

     Lifetime      32-bit unsigned integer.  The maximum time in
                   seconds (relative to the time the packet is received)



Jeong, et al.          Expires September 15, 2016               [Page 7]

Internet-Draft             IPv6 RA DNS Options                March 2016


                   over which these DNSSL domain names MAY be used for
                   name resolution.  The Lifetime value has the same
                   semantics as with the RDNSS option.  That is,
                   Lifetime SHOULD by default be at least
                   3 * MaxRtrAdvInterval.  A value of all one bits
                   (0xffffffff) represents infinity.  A value of zero
                   means that the DNSSL domain names MUST no longer be
                   used.

     Domain Names of DNS Search List
                   One or more domain names of DNS Search List that MUST
                   be encoded as described in Section 3.1 of [RFC1035].
                   By this technique, each domain name is represented as
                   a sequence of labels ending in a zero octet, defined
                   as domain name representation.  For more than one
                   domain name, the corresponding domain name
                   representations are concatenated as they are.  Note
                   that for the simple decoding, the domain names MUST
                   NOT be encoded in a compressed form, as described in
                   Section 4.1.4 of [RFC1035].  Because the size of this
                   field MUST be a multiple of 8 octets, for the minimum
                   multiple including the domain name representations,
                   the remaining octets other than the encoding parts of
                   the domain name representations MUST be padded with
                   zeros.

5.3.  Procedure of DNS Configuration

   The procedure of DNS configuration through the RDNSS and DNSSL
   options is the same as with any other ND option [RFC4861].

5.3.1.  Procedure in IPv6 Host

   When an IPv6 host receives DNS options (i.e., RDNSS option and DNSSL
   option) through RA messages, it processes the options as follows:

   o  The validity of DNS options is checked with the Length field; that
      is, the value of the Length field in the RDNSS option is greater
      than or equal to the minimum value (3), and satisfies that (Length
      - 1) % 2 == 0.  The value of the Length field in the DNSSL option
      is greater than or equal to the minimum value (2).  Also, the
      validity of the RDNSS option is checked with the "Addresses of
      IPv6 Recursive DNS Servers" field; that is, the addresses should
      be unicast addresses.

   o  If the DNS options are valid, the host SHOULD copy the values of
      the options into the DNS Repository and the Resolver Repository in
      order.  Otherwise, the host MUST discard the options.



Jeong, et al.          Expires September 15, 2016               [Page 8]

Internet-Draft             IPv6 RA DNS Options                March 2016


   In the case where the DNS options of RDNSS and DNSSL can be obtained
   from multiple sources, such as RA and DHCP, the IPv6 host SHOULD keep
   some DNS options from all sources.  Unless explicitly specified for
   the discovery mechanism, the exact number of addresses and domain
   names to keep is a matter of local policy and implementation choice
   as a local configuration option.  However, in the case of multiple
   sources, the ability to store a total of at least three RDNSS
   addresses (or DNSSL domain names) from the multiple sources is
   RECOMMENDED.  The DNS options from Router Advertisements and DHCP
   SHOULD be stored into the DNS Repository and Resolver Repository so
   that information from DHCP appears there first and therefore takes
   precedence.  Thus, the DNS information from DHCP takes precedence
   over that from RA for DNS queries.  On the other hand, for DNS
   options announced by RA, if some RAs use the Secure Neighbor
   Discovery (SEND) protocol [RFC3971] for RA security, they MUST be
   preferred over those that do not use SEND.  Refer to Section 6 for
   the detailed discussion on SEND for RA DNS options.

5.3.2.  Warnings for DNS Options Configuration

   There are two warnings for DNS options configuration: (i) warning for
   multiple sources of DNS options and (ii) warning for multiple network
   interfaces.  First, in the case of multiple sources for DNS options
   (e.g., RA and DHCP), an IPv6 host can configure its IP addresses from
   these sources.  In this case, it is not possible to control how the
   host uses DNS information and what source addresses it uses to send
   DNS queries.  As a result, configurations where different information
   is provided by different sources may lead to problems.  Therefore,
   the network administrator needs to configure different DNS options in
   the multiple sources in order to minimize the impact of such problems
   [DHCPv6-SLAAC].

   Second, if different DNS information is provided on different network
   interfaces, this can lead to inconsistent behavior.  The IETF worked
   on solving this problem for both DNS and other information obtained
   by multiple interfaces [RFC6418][RFC6419], and standardized the
   solution for RDNSS selection for multi-interfaced nodes in [RFC6731],
   which is based on DHCP.

6.  Security Considerations

   In this section, we analyze security threats related to DNS options
   and then suggest recommendations to cope with such security threats.

6.1.  Security Threats

   For the RDNSS option, an attacker could send an RA with a fraudulent
   RDNSS address, misleading IPv6 hosts into contacting an unintended



Jeong, et al.          Expires September 15, 2016               [Page 9]

Internet-Draft             IPv6 RA DNS Options                March 2016


   DNS server for DNS name resolution.  Also, for the DNSSL option, an
   attacker can let IPv6 hosts resolve a host name without a DNS suffix
   into an unintended host's IP address with a fraudulent DNS Search
   List.  These attacks are similar to ND attacks specified in [RFC4861]
   that use Redirect or Neighbor Advertisement messages to redirect
   traffic to individual addresses of malicious parties.

   However, the security of these RA options for DNS configuration does
   not affect ND protocol security [RFC4861].  This is because learning
   DNS information via the RA options cannot be worse than learning bad
   router information via the RA options.  Therefore, the vulnerability
   of ND is not worse and is a subset of the attacks that any node
   attached to a LAN can do.

6.2.  Recommendations

   The Secure Neighbor Discovery (SEND) protocol [RFC3971] is designed
   as a security mechanism for ND.  In this case, ND can use SEND to
   allow all the ND options including the RDNSS and DNSSL options to be
   automatically included in the signatures.  Other approaches specified
   in [RFC4861] can be used for securing the RA options for DNS
   configuration.

   It is common for network devices such as switches to include
   mechanisms to block unauthorized ports from running a DHCPv6 server
   to provide protection from rogue DHCPv6 servers [RFC7610].  That
   means that an attacker on other ports cannot insert bogus DNS servers
   using DHCPv6.  The corresponding technique for network devices is
   RECOMMENDED to block rogue Router Advertisement messages [RFC6104]
   including the RDNSS and DNSSL options from unauthorized nodes.

   An attacker may provide a bogus DNS Search List option in order to
   cause the victim to send DNS queries to a specific DNS server when
   the victim queries non-FQDNs (fully qualified domain names).  For
   this attack, the DNS resolver in IPv6 hosts can mitigate the
   vulnerability with the recommendations mentioned in [RFC1535],
   [RFC1536], and [RFC3646].

7.  IANA Considerations

   The RDNSS option defined in this document uses the IPv6 Neighbor
   Discovery Option type defined in RFC 6106 [RFC6106], which was
   assigned by the IANA as follows:

                 Option Name                   Type
                 Recursive DNS Server Option   25

   The DNSSL option defined in this document uses the IPv6 Neighbor



Jeong, et al.          Expires September 15, 2016              [Page 10]

Internet-Draft             IPv6 RA DNS Options                March 2016


   Discovery Option type defined in RFC 6106 [RFC6106], which was
   assigned by the IANA as follows:

                 Option Name                   Type
                 DNS Search List Option        31

   These options have been registered in the "Internet Control Message
   Protocol version 6 (ICMPv6) Parameters" registry (http://
   www.iana.org/assignments/icmpv6-parameters/
   icmpv6-parameters.xhtml#icmpv6-parameters-5).

8.  Acknowledgements

   This document has greatly benefited from inputs by Robert Hinden,
   Pekka Savola, Iljitsch van Beijnum, Brian Haberman, Tim Chown, Erik
   Nordmark, Dan Wing, Jari Arkko, Ben Campbell, Vincent Roca, Tony
   Cheneau, Fernando Gont, Jen Linkova, Ole Troan, Mark Smith, Tatuya
   Jinmei, Lorenzo Colitti, Tore Anderson, David Farmer, and Bing Liu.
   The authors sincerely appreciate their contributions.

   This document was supported by Institute for Information &
   communications Technology Promotion (IITP) grant funded by the Korea
   government (MSIP) [10041244, Smart TV 2.0 Software Platform].

9.  References

9.1.  Normative References

   [RFC2119]       Bradner, S., "Key words for use in RFCs to Indicate
                   Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC4861]       Narten, T., Nordmark, E., Simpson, W., and H.
                   Soliman, "Neighbor Discovery for IP version 6
                   (IPv6)", RFC 4861, September 2007.

   [RFC4862]       Thomson, S., Narten, T., and T. Jinmei, "IPv6
                   Stateless Address Autoconfiguration", RFC 4862,
                   September 2007.

   [RFC1035]       Mockapetris, P., "Domain names - implementation and
                   specification", STD 13, RFC 1035, November 1987.

   [RFC4007]       Deering, S., Haberman, B., Jinmei, T., Nordmark, E.,
                   and B. Zill, "IPv6 Scoped Address Architecture",
                   RFC 4007, March 2005.






Jeong, et al.          Expires September 15, 2016              [Page 11]

Internet-Draft             IPv6 RA DNS Options                March 2016


9.2.  Informative References

   [RFC1034]       Mockapetris, P., "Domain names - concepts and
                   facilities", STD 13, RFC 1034, November 1987.

   [RFC3315]       Droms, R., Bound, J., Volz, B., Lemon, T., Perkins,
                   C., and M. Carney, "Dynamic Host Configuration
                   Protocol for IPv6 (DHCPv6)", RFC 3315, July 2003.

   [RFC3736]       Droms, R., "Stateless Dynamic Host Configuration
                   Protocol (DHCP) Service for IPv6", RFC 3736,
                   April 2004.

   [RFC3646]       Droms, R., "DNS Configuration options for Dynamic
                   Host Configuration Protocol for IPv6 (DHCPv6)",
                   RFC 3646, December 2003.

   [RFC5006]       Jeong, J., Park, S., Beloeil, L., and S. Madanapalli,
                   "IPv6 Router Advertisement Option for DNS
                   Configuration", RFC 5006, September 2007.

   [RFC6106]       Jeong, J., Park, S., Beloeil, L., and S. Madanapalli,
                   "IPv6 Router Advertisement Options for DNS
                   Configuration", RFC 6106, November 2010.

   [RFC4339]       Jeong, J., "IPv6 Host Configuration of DNS Server
                   Information Approaches", RFC 4339, February 2006.

   [RFC3971]       Arkko, J., Kempf, J., Zill, B., and P. Nikander,
                   "SEcure Neighbor Discovery (SEND)", RFC 3971,
                   March 2005.

   [RFC6104]       Chown, T. and S. Venaas, "Rogue IPv6 Router
                   Advertisement Problem Statement", RFC 6104,
                   February 2011.

   [RFC7610]       Gont, F., Liu, W., and G. Van de Velde, "DHCPv6-
                   Shield: Protecting against Rogue DHCPv6 Servers",
                   RFC 7610, August 2015.

   [RFC1535]       Gavron, E., "A Security Problem and Proposed
                   Correction With Widely Deployed DNS Software",
                   RFC 1535, October 1993.

   [RFC1536]       Kumar, A., Postel, J., Neuman, C., Danzig, P., and S.
                   Miller, "Common DNS Implementation Errors and
                   Suggested Fixes", RFC 1536, October 1993.




Jeong, et al.          Expires September 15, 2016              [Page 12]

Internet-Draft             IPv6 RA DNS Options                March 2016


   [DHCPv6-SLAAC]  Liu, B., Jiang, S., Gong, X., Wang, W., and E. Rey,
                   "DHCPv6/SLAAC Interaction Problems on Address and DNS
                   Configuration", Work in Progress, February 2016.

   [RFC6418]       Blanchet, M. and P. Seite, "Multiple Interfaces and
                   Provisioning Domains Problem Statement", RFC 6418,
                   November 2011.

   [RFC6419]       Wasserman, M. and P. Seite, "Current Practices for
                   Multiple-Interface Hosts", RFC 6419, November 2011.

   [RFC6731]       Savolainen, T., Kato, J., and T. Lemon, "Improved
                   Recursive DNS Server Selection for Multi-Interfaced
                   Nodes", RFC 6731, December 2012.

Appendix A.  Changes from RFC 6106

   The following changes were made from RFC 6106 "IPv6 Router
   Advertisement Options for DNS Configuration":

   o  The generation of Router Solicitation to ensure that the RDNSS
      information is fresh before the expiry of the RDNSS option is
      removed in order to prevent multicast traffic on the link from
      increasing.

   o  The lifetime's upper bound of 2 * MaxRtrAdvInterval was shown to
      lead to the expiry of these options on links with a relatively
      high rate of packet loss.  This revision relaxes the upper bound
      and sets a higher default value to avoid this problem.

   o  The addresses for recursive DNS servers in the RDNSS option can be
      not only global addresses, but also link-local addresses.  The
      link-local addresses for RDNSSes should be registered into the
      resolver repository along with the corresponding link zone
      indices.

   o  The recommendation that at most three RDNSS addresses to maintain
      by RDNSS options should be limited is removed.  By this removal,
      the number of RDNSSes to maintain is up to an implementer's local
      policy.

   o  The recommendation that at most three DNS domains to maintain by
      DNSSL options should be limited is removed.  By this removal, when
      the set of unique DNSSL values are not equivalent, none of them
      are ignored for hostname lookups.

   o  The section of implementation considerations for RA DNS Options is
      removed.



Jeong, et al.          Expires September 15, 2016              [Page 13]

Internet-Draft             IPv6 RA DNS Options                March 2016


   o  The usage of the keywords of SHOULD and RECOMMENDED in RFC 2119 is
      removed in the recommendation of using SEND for secure ND.
      Instead of the keywords, SEND is specified as a possible solution
      for secure ND.

Authors' Addresses

   Jaehoon Paul Jeong
   Department of Software
   Sungkyunkwan University
   2066 Seobu-Ro, Jangan-Gu
   Suwon, Gyeonggi-Do  16419
   Republic of Korea

   Phone: +82 31 299 4957
   Fax:   +82 31 290 7996
   EMail: pauljeong@skku.edu
   URI:   http://iotlab.skku.edu/people-jaehoon-jeong.php


   Soohong Daniel Park
   Software R&D Center
   Samsung Electronics
   Seoul R&D Campus D-Tower, 56, Seongchon-Gil, Seocho-Gu
   Seoul  06765
   Republic of Korea

   EMail: soohong.park@samsung.com


   Luc Beloeil
   France Telecom R&D
   42, rue des coutures
   BP 6243
   14066 CAEN Cedex 4
   France

   Phone: +33 2 40 44 97 40
   EMail: luc.beloeil@orange-ftgroup.com












Jeong, et al.          Expires September 15, 2016              [Page 14]

Internet-Draft             IPv6 RA DNS Options                March 2016


   Syam Madanapalli
   iRam Technologies
   #H304, Shriram Samruddhi, Thubarahalli
   Bangalore - 560066
   India

   EMail: smadanapalli@gmail.com












































Jeong, et al.          Expires September 15, 2016              [Page 15]

